In [31]:
import pandas as pd

In [55]:
data = {
        'Name':['carol','maahi','dhruvi','shreya'],
        'Age':[21,21,22,20],
        'Address':['ahmedabad','delhi','mumbai','chennai'],
        'Qualification':['PHD','Msc','MA','MCA']
       }
data
#type(data)

{'Address': ['ahmedabad', 'delhi', 'mumbai', 'chennai'],
 'Age': [21, 21, 22, 20],
 'Name': ['carol', 'maahi', 'dhruvi', 'shreya'],
 'Qualification': ['PHD', 'Msc', 'MA', 'MCA']}

In [52]:
#convert the dictionary into DataFrame
df = pd.DataFrame(data)
df

     Address  Age    Name Qualification
0  ahmedabad   21   carol           PHD
1      delhi   21   maahi           Msc
2     mumbai   22  dhruvi            MA
3    chennai   20  shreya           MCA

In [34]:
df = pd.DataFrame(data)
type(df)

pandas.core.frame.DataFrame

In [35]:
df[['Name', 'Qualification']]

     Name Qualification
0   carol           PHD
1   maahi           Msc
2  dhruvi            MA
3  shreya           MCA

In [36]:
df[df.columns[1:4]]

   Age    Name Qualification
0   21   carol           PHD
1   21   maahi           Msc
2   22  dhruvi            MA
3   20  shreya           MCA

In [37]:
df.loc[1:6, ['Name','Qualification']]

     Name Qualification
1   maahi           Msc
2  dhruvi            MA
3  shreya           MCA

In [38]:
df.loc[0:1, 'Name':'Address']

Empty DataFrame
Columns: []
Index: [0, 1]

In [39]:
df.loc[0, :]

Address          ahmedabad
Age                     21
Name                 carol
Qualification          PHD
Name: 0, dtype: object

In [40]:
df.iloc[:, 0:2]

     Address  Age
0  ahmedabad   21
1      delhi   21
2     mumbai   22
3    chennai   20

In [41]:
df.iloc[:, 1]

0    21
1    21
2    22
3    20
Name: Age, dtype: int64

In [42]:
df.iloc[:, 0:2]

     Address  Age
0  ahmedabad   21
1      delhi   21
2     mumbai   22
3    chennai   20

In [43]:
df.iloc[0:2, 1:3]

   Age   Name
0   21  carol
1   21  maahi

In [57]:
df['Salary']=[1500 if x == 'Qualification' else 800 for x in df['Name']]
print(df)
df

     Address  Age    Name Qualification  Salary
0  ahmedabad   21   carol           PHD     800
1      delhi   21   maahi           Msc     800
2     mumbai   22  dhruvi            MA     800
3    chennai   20  shreya           MCA     800

     Address  Age    Name Qualification  Salary
0  ahmedabad   21   carol           PHD     800
1      delhi   21   maahi           Msc     800
2     mumbai   22  dhruvi            MA     800
3    chennai   20  shreya           MCA     800

In [59]:
df['disc']= df['Salary']*.10

In [60]:
df

     Address  Age    Name Qualification  Salary  disc
0  ahmedabad   21   carol           PHD     800  80.0
1      delhi   21   maahi           Msc     800  80.0
2     mumbai   22  dhruvi            MA     800  80.0
3    chennai   20  shreya           MCA     800  80.0

In [61]:
df.to_csv('mydata')

In [62]:
df = pd.read_csv('mydata')

In [63]:
df

   Unnamed: 0    Address  Age    Name Qualification  Salary  disc
0           0  ahmedabad   21   carol           PHD     800  80.0
1           1      delhi   21   maahi           Msc     800  80.0
2           2     mumbai   22  dhruvi            MA     800  80.0
3           3    chennai   20  shreya           MCA     800  80.0

In [65]:
df.to_excel('myexcel.xlsx')

In [66]:
df = pd.read_csv('mydata')

In [67]:
df

   Unnamed: 0    Address  Age    Name Qualification  Salary  disc
0           0  ahmedabad   21   carol           PHD     800  80.0
1           1      delhi   21   maahi           Msc     800  80.0
2           2     mumbai   22  dhruvi            MA     800  80.0
3           3    chennai   20  shreya           MCA     800  80.0